{
  "title": "Adventure in the Unseen Jungle: Episode 1 - The Unexpected Greeting",
  "body": "Once upon a time, at the outskirts of the small city known as Nevela, there sat a grand but lonely structure called The Royal Crest Hostel. It was located right near the edge of the massive, untamed forest that the locals aptly referred to as the 'Unseen Jungle.' Two friends, known as Finn and Toby, lived there. They were adventurous by nature, always seeking excitement in their otherwise mundane hostel life.\n\nOne morning, Finn, a determined and brave soul, proposed the idea of venturing into the Unseen Jungle. Toby, though fearful, didn't want to let his friend down, so he agreed to come along. With backpacks filled with essential supplies and hearts pumping with adrenaline, the duo made their way towards the dense, intimidating forest.\n\nBarely a few steps in, they were startled by a rustling sound followed by a strange, deep-voiced greeting. 'Welcome, travelers!' Reading each other's alarmed faces, they proceeded further and were taken aback by what they saw.\n\nIn front of them stood an assembly of creatures unlike any they had seen before: small humanoid plants with leaves for hair and bark-like skin, tiny glowing balls of light darting around like bees, and a tall, wolf-like being who seemed to be the one who had spoken. 'We are the dwellers of this forest.' the wolf-like entity, whom they later came to know as Faelan, continued. 'We have been watching you, Finn and Toby, and we’re pleased to see you've finally decided to visit.'\n\nFinn and Toby were stunned but curiosity piqued. Despite their surprise, they introduced themselves and apologized for intruding. Yet, Faelan assured them, 'You're not intruding. We were expecting you.' Before they could ask any more questions, Faelan waved them forward and they were led deeper into the jungle.\n\nThe friends looked at each other, their hesitation cast aside by the strange allure of the events unfolding before them. They were greeted by more creatures, each more peculiar than the last. While it felt surreal, Finn and Toby knew they had embarked on an adventure bigger than they had ever anticipated.\n\nThe day ended with a feast, where the creatures celebrated the arrival of their new friends. A sense of enchantment hung in the air, and the pair found themselves more thrilled than scared. They decided to spend the night in a shelter provided by their hosts, surrounded by the strange, yet comforting hum of the forest.\n\nHowever, just as they were drifting off to sleep, a sudden, chilling roar echoed through the forest. The ground beneath them trembled, and a sense of foreboding filled the air. Finn and Toby exchanged frightened glances. What had they stumbled upon? And what was the roar that even seemed to stun the fearless Faelan?",
  "killed_characters": [],
  "current_characters": [
    "Finn",
    "Toby",
    "Faelan"
  ]
}