{
  "title": "Cloaked Shadows",
  "body": "Saumy and Bhanu, now adults, had studied in the same school since nursery in a small village in Uttar Pradesh. They had walked down the dusty trails, learned under the village tree, and shared countless lunchboxes. Now, after years of being apart, they found themselves standing under the same peepal tree, albeit much taller and sturdier, ready for the alumni meet.\n\n'Saumy, it feels like nothing has changed,' Bhanu quavered, looking at the familiar sights with a mixture of nostalgia and fear. Bhanu had always been a bit skittish, unlike Saumy, who held a courageous heart.\n\nThe reunion had been joyous, filled with laughter and old stories. As dusk fell, the old school building, bathed in the glow of dim lanterns, appeared ghostly. Bhanu shivered, while Saumy chuckled at his old friend's unease.\n\nJust as Bhanu was about to suggest they leave, a loud crash echoed from the school building, freezing everyone in their tracks. Saumy and Bhanu exchanged looks. Saumy's eyes were ignited with curiosity, while Bhanu's held undisguised dread.\n\n'Let's check it out,' Saumy suggested, moving towards the sound. Bhanu reluctantly followed, his heart hammering in his chest.\n\nThe school building was eerily silent now. The only sound was the rustling of old papers being nudged by the cool night wind. Suddenly, a locker door flew open violently, papers flying everywhere. Saumy jumped back, startled, while Bhanu screamed at the top of his lungs.\n\nThey barely had time to recover when another wave of strange occurrences rolled over them. The old gramophone in the corner started playing a haunting melody. Tables and chairs began to shake violently. Shadows moved inexplicably on the walls. The air turned chillingly cold.\n\n'Saumy, let's get out of here!' Bhanu pleaded, his eyes wide with horror. Saumy, trying to stay calm, nodded, grabbing Bhanu's hand. But as they tried to leave, the door slammed shut on its own, the lock clicking into place.\n\nThey were trapped.\n\nSaumy tried to pry open the door, his fingers bleeding, while Bhanu sat in a corner, praying fervently. Suddenly, a chilling voice whispered behind them, 'You shouldn't have come back.'\n\nThey whipped around, but no one was there. Bhanu's trembling lump and Saumy's heart pounding in his chest were the only signs of life in the room. The haunting melody continued to play, the shadows danced, and the voice echoed, 'You shouldn't have come back.'",
  "killed_characters": [],
  "current_characters": [
    "saumy",
    "bhanu"
  ],
  "ended_at": "Bhanu's trembling lump and Saumy's heart pounding in his chest were the only signs of life in the room. The haunting melody continued to play, the shadows danced, and the voice echoed, 'You shouldn't have come back.'",
  "summary_till_now": "After many years apart, childhood friends Saumy and Bhanu return to their old school in Uttar Pradesh for an alumni meet. Reuniting under the same tree where they used to learn, they are both filled with nostalgia, though Bhanu also feels a sense of fear. During the reunion, a loud crash from the school building interrupts the joyful atmosphere. Despite Bhanu's dread, Saumy's curiosity leads them to investigate. Inside the eerily silent building, uncanny events occur, including a locker door flying open, a gramophone playing a haunting melody, furniture shaking, and shadows moving on their own. As they try to escape, the door mysteriously locks, trapping them inside. A chilling voice whispers that they shouldn't have come back, leaving them in a room filled with haunting sounds and their own palpable fear."
}