{
  "title": "The House on Arlington Road: Nightfall",
  "body": "It was a serene autumn evening in the rural suburb of Sleepy Hollow. The sky, a multitude of oranges and purples as the unforgiving sun sunk below the horizon. Four childhood friends, Frodo, Sam, Merry, and Pippin, were walking down a deserted path, their laughter echoing through the quiet. \n\nA peculiar house lay sprawled at the end of the Arlington Road. It was an intimidating structure, its imposing silhouette cast against the fading twilight. Forgotten by time, it had remained unoccupied for years, a testament to the ghost stories and urban legends that entwined it. Tonight, against their better judgment, the children decided to explore it. \n\nArmed with nothing but their fading courage and dim torchlights, they pushed the creaking door open. The spine-chilling wind, tainted with the smell of decay, greeted them. They began their exploration, delving into the yawning darkness. They found themselves in a grand hall, its grandeur overshadowed by neglect. Grandfather clocks echoed the passing seconds into the void, their rhythmic ticking a morbid symphony in the cold, eerie silence. \n\nSuddenly, the sound of shuffling from the second floor reached their ears. The dust-laden air thickened around them, their hearts pounding in their chests. As they ascended, each thud of their footsteps seemed to reverberate through the house, almost as if awakening something within its dormant walls. An unseen force grew stronger, their innocent curiosity transforming into a tangible dread. \n\nThe first to fall was Sam. He simply vanished as they moved through an ominous corridor, his terrified scream lingering in the air before being swallowed by the house. A frantic search yielded no signs of him, but the house appeared to be alive now, throwing hallucinatory visions at Merry and Pippin, driving them into a frenzied panic. They separated in their madness, their screams piercing the heavy silence intermittently until they too ceased. \n\nFrodo, now alone, found himself in the house's monstrous belly. His torchlight flickered, the shadows around him dancing in macabre joy. The house seemed intent on claiming him too. He fought off the encroaching fear, running towards the faint moonlight streaming from the entryway. As he burst out, the door slammed shut behind him, returning the house to its brooding silence. \n\nTears streamed down Frodo's face as he looked back at the enigmatic relic, his friends claimed by its malevolent spirit. The tales they had dismissed as folklore were all too real. Heedless of his exhaustion, he sprinted away, desperate to leave the haunting scene behind. As he fled, a bone-rattling shriek emanated from the house, marking the end of this horrific night. It echoed in the pitch black night, a chilling reminder of the friends he had lost. The House on Arlington Road had awakened, its thirst for fear satiated, for now.",
  "killed_characters": [
    "Sam",
    "Merry",
    "Pippin"
  ],
  "current_characters": [
    "Frodo"
  ]
}