{
  "title": "The Spectral Night",
  "body": "The moon had risen high into the pitch-black night sky, the once lively group of friends was now eerily silent as they delved deeper into the house's depths. The house itself seemed to creak and groan beneath the weight of its own tortured history, the wind whistling mournfully through its cracked and weathered walls. It was as if the old house was alive with unrest.\n\nFrodo, Sam, Merry, and Pippin, each armed with dimly lit lanterns, were exploring the dusty old rooms with a sense of morbid curiosity. Suddenly, Sam, the most grounded of the lot, started to feel uneasy. The creak of a loose floorboard, the shiver of a draft down the hall, everything began to grow unsettling.\n\nDown the cobwebbed hallway, a sudden chill danced across Merry's skin, causing him to shiver involuntarily. His heart pounded in his chest like a frightened rabbit. He realized, with a start, that they were not alone in the house.\n\n'Guys,' Merry's voice wavered, 'I think we should leave.'\n\nPippin, always the skeptic, rolled his eyes. 'Scared of a few cobwebs, eh Merry?'\n\nMerry frowned, 'It's not just that, Pip. I feel...watched.'\n\nA sudden crash echoed from the floors above, followed by a bone-chilling silence. All the boys froze. Pippin's mockery died on his lips, and his face whitened. Frodo gulped and exchanged worried glances with Sam.\n\nWithout another word, they rushed towards the entrance, only to find it locked from the outside. Panic began to set in. As the boys struggled with the lock, the house seemed to come alive. Shadows danced off the walls. Whispers filled the air, soft and pleading.\n\nSam, Merry, and Pippin turned to Frodo, the quiet thinker of the group, for a solution. Frodo, pale but composed, suggested they split up in search for another exit. Despite the protests, Frodo insisted, stressing the urgency of their situation.\n\nAnd so they split. Halfway through his search, Frodo heard a loud cry. Merry and Pippin were not in sight. A chill went down his spine as he discovered Sam's abandoned lantern, flickering ominously.\n\nIncreasingly terrified, Frodo stumbled upon a hidden passage leading to the back of the house. With one last look at the now menacing house, Frodo dashed through the passage and into the forest. As he ran, he heard a terrifying scream echoing from the house. With a chill in his heart, he realized that the house had claimed his friends.\n\nJust as Frodo thought he was safe, an ear-piercing shriek echoed from the house, followed by an unbearable silence. He looked over his shoulder at the house, its sinister silhouette looming menacingly in the night. His heart pounded as he realized he was the only one who had escaped. The real nightmare was far from over.",
  "killed_characters": [
    "Sam",
    "Merry",
    "Pippin"
  ],
  "current_characters": [
    "Frodo"
  ],
  "summary_till_now": ", Frodo, Sam, Merry, and Pippin, were walking down a deserted path. a peculiar house lay sprawled at the end of the Arlington Road. it was an intimidating structure, its imposing silhouette cast against the fading twilight. they began their exploration, delving into the yawning darkness.\n, Frodo, Sam, Merry, and Pippin, each armed with dimly lit lanterns, were exploring the dusty old rooms with a sense of morbid curiosity. Suddenly, Merry began to feel uneasy. 'Guys,' Merry's voice wavered, 'I think we should leave.' a sudden crash echoed from the floors above, followed by a bone-chilling silence."
}