{
  "title": "Unseen Shadows",
  "body": "My name is Bhanu. I am but a simple villager in the idyllic hamlet of Panchala, tucked away deep within the mystical ranges of the Himalayas. Life was good, until that fateful day when Mordor, a neighboring kingdom high up in the mountains, attacked our humble village, laying waste to our homes and sowing fear in our hearts.\n\nOur once tranquil abode was now a theatre of screams, smoke and corpses. The crops we had toiled over, the homes we had lovingly built, were razed to the ground as if they were mere playthings. I held my little sister, Saumy, close to my chest as we watched our world burn.\n\n'Saumy, we must rebuild,' I told her, tears tracing down my face. Her eyes hardened as she nodded, her hand squeezing mine in resolve. Only then did it dawn on me: we were the sole survivors.\n\nThe village elder had once told us tales of Mordor's palace, a formidable fortress nestled high up in those icy peaks. The only way to stop further attacks and bring peace to our village was to become the king of that palace. I knew the journey was perilous, the task impossible. But for my sister, for my people, I had to try.\n\nSo, we set off on a harrowing journey, trekking through dense forests and climbing treacherous slopes, armed with nothing but our courage and a map the elder had given me years ago. After a week of relentless travel, we finally lay our eyes on Mordor's palace, a dark edifice that towered over us ominously. We both knew that we were out of our depth.\n\nWe decided to camp by a nearby stream that night, waiting for dawn so we could infiltrate the palace. During the day, Saumy would practice with the sling I had made for her from a leather strip and a small pouch, while I would strategize our plan of attack. Every night, we would huddle together for warmth, the empty spot next to us a cruel reminder of our lost family. Our spirits were low but not broken. Not yet.\n\nThe dawn of our assault arrived, cloaked in a haunting mist that seemed to reflect our apprehension. As we trudged up the hill towards the palace, I could feel my heart drumming in my chest. Saumy slipped her hand into mine, her grip tight with determination. Our plan was simple: Saumy would use her sling to distract the guards, giving me a chance to sneak in.\n\nTaking a deep breath, I nodded at her, watching as she picked up a smooth pebble and placed it in her sling. She gave me a small smile, one that didn't quite reach her eyes, before turning and running towards the entrance, her silhouette disappearing in the rising fog. As the shout of the guards echoed in the valley, I started my perilous climb up the palace walls.\n\nI was just a few feet away from the top when the unthinkable happened. A guard spotted me, his eyes widening as he sounded the alarm. Just as a volley of arrows was released, I heard a blood-curdling scream. 'Bhanu!'\n\nIn my peripheral vision, I saw Saumy fall.",
  "killed_characters": [],
  "current_characters": [
    "bhanu",
    "saumy"
  ],
  "ended_at": "I was just a few feet away from the top when the unthinkable happened. A guard spotted me, his eyes widening as he sounded the alarm. Just as a volley of arrows was released, I heard a blood-curdling scream. 'Bhanu!'\n\nIn my peripheral vision, I saw Saumy fall.",
  "summary_till_now": "Bhanu, a simple villager from the Himalayan hamlet of Panchala, recounts the devastating invasion of his peaceful village by the kingdom of Mordor. The attack reduces their homes to rubble and leaves Bhanu and his younger sister, Saumy, as the only survivors. Driven by the need to prevent future attacks and restore peace, Bhanu decides that they must take control of Mordor's palace, a formidable fortress. Armed with courage and an old map, they embark on a treacherous journey through dense forests and steep slopes. Despite their fears and the palpable reminder of their lost family, their determination keeps them going.\n\nUpon reaching the palace, they devise a plan to infiltrate it. Saumy, armed with a sling, is to distract the guards while Bhanu sneaks in. As their plan is set into motion, Bhanu is spotted just as he nears the top of the wall. Amidst the ensuing chaos, he hears a scream and sees Saumy falling, leaving the tale on a tragic cliffhanger."
}