{
  "title": "Siege in Shadows",
  "body": "The world seemed to freeze as my sister's scream echoed through the air. I watched in horror as Saumy plummeted, her small form disappearing into the shadows. My heart pounded in my ears, threatening to drown the alarm cries of the Mordor guards. But in that moment, I knew I couldn't afford the luxury of shock or grief. \n\nWith an adrenaline-fueled burst, I surged forward, scaling the wall with reckless abandon. My fingers bled, nails scraping against the cold stone, but the pain was a distant sensation, blurred by the enormity of my sister's fall. Reaching the top, I hurled myself onto the guard who had spotted me, catching him off guard. His eyes widened in surprise as we both tumbled onto the flagstones, his spear clattering away. A swift punch and he was unconscious. \n\nPanting heavily, I dragged myself to my feet and darted into the shadows, blending into the darkness. I had to find Saumy, check if she was still alive. But first, I needed to become the ghost the palace guards would fear, the phantom king they wouldn't see coming. \n\nFor several days, I managed to evade the guards, lurking in the quieter sections of the palace, stealing food and gathering information. Kingship wasn't won by brute force alone — I needed a plan. The palace was a maze, a sprawling labyrinth of hallways, grand rooms, and secret passages. I spent my days mapping it out, identifying possible escape routes and places of vulnerability. \n\nOne night as I was crouched in the shadows of a grand hallway, I heard footsteps approach. Slipping further into the darkness, I watched as two figures emerged – the king and his advisor. Their conversation was hushed but my heart pounded as I realised the king was planning another attack on Panchala.\n\nI knew what I had to do now. I had to confront the king, appeal to his sense of humanity, if he had any left. But first, Saumy. I had to find her, ensure she was safe. As the king and his advisor disappeared down the hallway, I slipped out of the shadows and made my way to where Saumy had fallen. \n\nI approached the spot with a heavy heart, every nerve in my body screaming in fear of what I might find. My heart almost stopped beating when I saw a small form huddled in the shadows. 'Saumy,' I breathed, rushing to her side.\n\nMy sister looked up at me, pain clear in her eyes, but there was a tenacity there that made hope surge within me. 'Bhanu,' she said, her voice a whisper. 'I'm not dead yet.' \n\nWe held each other then, the pain of the last few days rolling over us like a storm. But we weren't broken, not yet. We had a home to save, a tyrant king to dethrone, and the possible wrath of an entire kingdom to face. And faced with these obstacles, there was no other choice but to rise.",
  "killed_characters": [],
  "current_characters": [
    "bhanu",
    "saumy"
  ],
  "ended_at": "'I'm not dead yet.' \n\nWe held each other then, the pain of the last few days rolling over us like a storm. But we weren't broken, not yet. We had a home to save, a tyrant king to dethrone, and the possible wrath of an entire kingdom to face. And faced with these obstacles, there was no other choice but to rise.",
  "summary_till_now": "Bhanu, a simple villager from the Himalayan hamlet of Panchala, recounts the devastating invasion of his peaceful village by the kingdom of Mordor. The attack reduces their homes to rubble and leaves Bhanu and his younger sister, Saumy, as the only survivors. Driven by the need to prevent future attacks and restore peace, Bhanu decides that they must take control of Mordor's palace, a formidable fortress. Armed with courage and an old map, they embark on a treacherous journey through dense forests and steep slopes. Despite their fears and the palpable reminder of their lost family, their determination keeps them going.\n\nUpon reaching the palace, they devise a plan to infiltrate it. Saumy, armed with a sling, is to distract the guards while Bhanu sneaks in. As their plan is set into motion, Bhanu is spotted just as he nears the top of the wall. Amidst the ensuing chaos, he hears a scream and sees Saumy falling, leaving the tale on a tragic cliffhanger.\nThe protagonist's sister, Saumy, falls into a pit, resulting in a terrifying scream that alerts the guards. Driven by the fear for his sister's life, the protagonist bravely scales a wall and neutralizes a guard who spotted him. After ensuring his cover, he prioritizes locating Saumy over his immediate safety. Living like a ghost in the palace, the protagonist spends several days evading guards, stealing food, and gathering crucial information about the palace's layout, identifying the potential escape routes and vulnerabilities. One night, he overhears a conversation between the king and his advisor, revealing plans for another attack on Panchala. Despite the impending danger, the protagonist decides to confront the king, but first, he must find Saumy. He discovers Saumy alive, albeit injured, which fills him with hope. They reconcile and resolve to confront the challenges ahead: saving their home, dethroning a tyrant king, and bracing themselves for the potential wrath of an entire kingdom."
}