{
  "title": "Episode 2: Snowman Strikes Back",
  "body": "Overwhelmed by their own creation, Rudy, Timmy, and Olive stared at their snowman - now oddly animate and ferociously imposing. 'We've definitely outdone ourselves this time,' muttered Rudy, his eyes wide with terror and awe. \n\nSuddenly, the snowman swung its icy limbs, catching Timmy off guard and sending him sprawling onto his back with a yelp. Olive shrieked, her freckles standing stark against her pale face, and Rudy, summoning his courage, darted forward to distract the snow-creature. \n\n'I think it's time we melt our masterpiece,' said Rudy, pulling a small bottle of water from his pocket. But the snowman was quicker. It hurtled a snowball, knocking the bottle from Rudy's hand. As the water spilled onto the snow, the snowman seemed to grow even more formidable. 'Well, that backfired,' Olive commented, earning a glare from Rudy. \n\n'What do we do now?' asked Timmy from his sprawled position on the ground. Rudy looked at Olive and shrugged, 'I guess we fight back?' \n\nThe trio made a fortress of snowballs and began their attack. But each snowball only seemed to make the snowman bigger and stronger. Suddenly, a loud bark echoed through the winter air, and into the battlefield came Mr. Whiskers, Rudy's pet dog, growling and baring his teeth at the snow-creature. \n\n'Good boy, Whiskers,' cheered Rudy, but the snowman was undeterred. It swatted at the dog, missing by a hair's breadth as Whiskers nimbly side-stepped the attack. Rudy found his adrenaline pumping, a plan forming in his mind. 'Guys,' he said, grinning, 'I think I know how to stop the snowman.' \n\n'Anything, Rudy,' Olive said, 'We're out of ideas.' Timmy looked scared but determined, 'What's the plan?' \n\nRudy turned to Whiskers, 'Whiskers,' he said, 'Fetch!' and threw a stick far away. Whiskers, ever obedient, took off, the snowman following suit, seemingly fascinated by the dog's game. The snowman, in its pursuit, grew farther and farther away from the kids. \n\n'Now!' Rudy yelled, and the trio advanced, pelting the snowman with salt they'd gotten from Rudy's garage. The effect was immediate. The snowman shrank, its icy countenance melting away rapidly. Cheers arose from the children. They had won. Or so they thought. \n\n'Guys,' Olive whispered, pointing at a small puddle of water near her foot. From the puddle, a small figure was once again beginning to rise, this time, looking a lot less friendly and a lot more vengeful.",
  "killed_characters": [],
  "current_characters": [
    "Rudy",
    "Olive",
    "Timmy",
    "Mr. Whiskers"
  ],
  "summary_till_now": ",,,, hurling a snowball at an unsuspecting Olive who could only let out a high-pitched yelp. chubby-cheeked Rudy, freckle-nosed Olive and bespectacled Timmy excelled in giving life to innocent snow forms.\nthe trio made a fortress of snowballs and began their attack. Suddenly, the snowman swung its icy limbs, catching Timmy off guard and sending him sprawling onto his back with a yelp. olive shrieked, her freckles standing stark against her pale face, and Rudy, summoning his courage, darted forward."
}