{
  "title": "The Shifting Sands: Episode 1",
  "body": "Saumy and I had been best friends since the second grade. We’d been pretty much inseparable, through high school, college, and beyond. Our shared love for adventure had taken us to some of the most exotic places on Earth. We’d hiked through the Amazon, bungee jumped in New Zealand, and even survived an avalanche in the Swiss Alps. But nothing, and I mean nothing, could’ve prepared us for that mysterious beach.\n\nIt was an unusually sunny day when we arrived there. Our hunger for unexplored terrain had led us to this secluded piece of coastline nestled somewhere between reality and imagination. The beach stretched as far as the eye could see, gleaming under the sun, flanked by dense, unfathomable forests. Something about this place, however, felt a little... off. \n\nThe first thing I noticed were the shadows. They were all wrong. No matter where the sun was, the shadows fell in the opposite direction. Then there were the tides, which moved independently of the moon. High tide and low tide within minutes of each other and water that tasted like... wine?\n\n'Karan, is it just me or is this place... weird?' Saumy asked, her eyebrows furrowed in confusion. I nodded, equally perplexed by the odd characteristics of our new discovery.\n\nThat night, we set up camp near the edge of the forest, under the protective cover of towering trees. As darkness fell, a strange symphony began – an inexplicable cacophony of sounds, none of which belonged to our world. It was as if the forest itself was alive, whispering secrets into the night.\n\nSuddenly, we heard a low growl, resonating from deep within the forest. Saumy quickly grabbed hold of a sturdy stick, her survival instincts kicking in. I turned on our flashlight, its feeble beam barely penetrating the thick, otherworldly fog. As I strained my eyes to discern what was lurking beyond our camp, something darted across our field of vision.\n\nOur hearts pounded in a rhythm of terror as we saw, for a fleeting second, a pair of glowing eyes. They were like nothing we’d seen before - a hauntingly beautiful neon blue. The creature to which they belonged, however, vanished before we could get a good look. \n\nBefore we could process what had happened, the ground beneath us started to tremble. A chill ran up our spines as we realized we were not alone in this uncanny beach landscape. Saumy and I exchanged horrified glances before turning our gaze back to the forest, the source of the unsettling sounds and ominous tremors.\n\nAs our flashlight’s beam hazily cut through the dense fog, we saw the silhouette of something colossal emerging from the dark abyss of the forest. A creature of nightmares stood at the edge of the tree line, its form concealed by the darkness. Its neon blue eyes, though, glowed with an eerie intensity. \n\n'This place is not normal, Karan,' Saumy whispered, the fear apparent in her voice.\n\nI was about to agree, when suddenly, our flashlight flickered and died, plunging us into an impenetrable darkness. From somewhere deep in the forest, the guttural growl echoed again, louder this time. Then, amidst the cacophony, a singular, clear sentence rang out, causing our hearts to almost stop.\n\n'Welcome, Saumy and Karan,' a chilling voice said, 'Enjoy your stay.'",
  "killed_characters": [],
  "current_characters": [
    "Saumy",
    "Karan"
  ]
}