{
  "title": "The Enigmatic Beach: Episode 2",
  "body": "The sun had been swallowed by the horizon, leaving Saumy and me, Karan, standing in the glow of the impending twilight. The sea had taken on a silvery sheen, mirroring the moonlight, and the sands under our feet had cooled down. We decided to set up camp for the night right at the edge of the beach, where the vegetation began.\n\n'Saumy', I called out, 'Do you feel it too?'\n\nShe looked at me, her eyes mirroring a similar unease. 'Something's off, isn't it?'\n\nThe tranquillity was almost eerie, the contours of the nearby forest appeared menacing in the dim light, but what disconcerted us was the complete absence of any life form. We were used to the rhythmic crooning of the nocturnal creatures, a symphony that serves as nature's lullaby. But here, there was nothing, just an uncomfortable quiet.\n\nWe somehow managed to drift into a restless sleep but were woken up by an inexplicable sensation. Our campfire, which had been extinguished before we slept, was now burning brightly. As we rubbed our eyes and sat up, we saw a figure standing at a distance near the water, bathed in the moonlight.\n\nBefore we could react, the figure vanished. By the time we made it to the spot, there were no signs of any human presence. Just as we were about to dismiss it as a figment of our imagination, Saumy noticed something. The waves, which were gently lapping at the shore, were now retreating, leaving a clear, wet trail on the sand. Only, it wasn't just water; there were tiny fluorescent particles glowing in the sand. We touched it, it was cool and shimmered upon contact.\n\n'Sea algae, they glow in the dark.', Saumy whispered, her eyes wide with astonishment.\n\nJust then, a sudden gust of wind swept across the beach, making the sand particles around us glow, illuminating a path deeper into the forest. We exchanged a glance. There was fear, yes, but an element of curiosity as well. Were we meant to follow this path?\n\nThe night was breaking into dawn when we decided to pack our stuff. The glowing path was still visible, leading us to the unknown. Without a word, we began following it, our hearts pounding but our intentions clear - we had to solve the mystery of this strange beach and find out who or what was trying to communicate with us. Little did we know, that the real adventure had just begun.",
  "killed_characters": [],
  "current_characters": [
    "Saumy",
    "Karan"
  ],
  "summary_till_now": "of adventure had led us to some of the most exotic places on Earth. We’d hiked through the Amazon, bungee jumped in New Zealand, and even survived an avalanche in the Swiss Alps. but nothing, and I mean nothing, could’ve prepared us for that mysterious beach.\nthe sun was swallowed by the horizon, and the sands under our feet had cooled down. we set up camp for the night right at the edge of the beach, where the vegetation began. 'Saumy', I called out, 'Do you feel it too?' she looked at me, her eyes wide with astonishment. before we could react, the figure disappeared, illuminating a path deeper into the forest."
}