{
  "title": "The Forbidden Beach",
  "body": "FADE IN:\n\nEXT. FORBIDDEN BEACH - DAY\n\nBHANU and SAUMY, two adventurous spirits, ignore the forbidden sign at the entrance of the eerie beach. The sign reads - 'DANGER AHEAD! DO NOT ENTER'.\n\nBhanu (grinning):\n\"You ready for the adventure of a lifetime, Saumy?\"\n\nSaumy (nervously):\n\"I don’t know about this, Bhanu...this place is off-limits for a reason.\"\n\nBhanu reassures him with an encouraging pat on the back.\n\nBhanu:\n\"Come on, don't be a spoilsport.\"\n\nThey step onto the unusually grey sand, the ominous clouds overhead casting long, threatening shadows.\n\nAs they delve deeper into the Forbidden Beach, unearthly sounds echo around them. The air gets thicker, leaving Saumy visibly worried. Bhanu, however, insists on pushing forward.\n\nSTAR WIPE TO:\n\nEXT. FORBIDDEN BEACH - NIGHTFALL\n\nAs the last ray of sunlight disappears, the beach takes on a more sinister face. The sea looks like black ink, reflecting no light. Strange, luminescent shapes dart in and out of the water.\n\nOut of nowhere, a chilling wind picks up, causing them to shiver.\n\nSaumy (worried):\n\"Bhanu, we need to get out of here. It’s not safe.\"\n\nBhanu (dismissively):\n\"Just chill, Saumy. We are fine!\"\n\nSuddenly a loud, ominous rumble sends a shudder through the beach. A massive, shadowy figure emerges from the sea, leaving them frozen in fear.\n\nBhanu (panicked):\n\"What the hell is that?\"\n\nSaumy is too terrified to respond.\n\nThe shadowy figure lunges towards them and they run, tripping over the uneven sand. Saumy manages to get up quickly and continues to run, screaming for Bhanu. But when he turns back, Bhanu is nowhere to be seen.\n\nSaumy (screaming):\n\"BHANU, WHERE ARE YOU? BHANU!\"\n\nThe figure lets out a deafening roar. Saumy, paralyzed with fear, watches as the shadowy figure moves back towards the sea.\n\nFADE OUT.\n\nTO BE CONTINUED...\n",
  "killed_characters": [
    "bhanu"
  ],
  "current_characters": [
    "saumy"
  ],
  "summary_till_now": "Two adventurous friends, Bhanu and Saumy, ignore a forbidden sign and enter an eerie beach. As they explore, strange events unfold, and they encounter a terrifying shadowy figure emerging from the sea. When the figure attacks, they run in fear, but only Saumy manages to escape, leaving Bhanu behind. The story ends with a sense of impending danger as the figure retreats into the sea."
}