{
  "title": "Tides of the Forbidden",
  "body": "Our lone survivor, Saumy, stumbled away from the beach, drenched in sweat and fear. He staggered back to his car, a last disbelieving look cast over his shoulder at the distant, menacing waves.\n\nFeeling an odd chill despite the tropical heat, he climbed into his vehicle and turned the keys. But the engine refused to start. Frustrated, anxious, he forced himself to breathe. He took a moment to collect his thoughts and try to make sense of the terrifying events.\n\nSuddenly, the radio switched on revealing a static noise before a distorted voice echoed through the car. 'Doomed, he who dares to cross the forbidden boundary. The sea's wrath awaits.' The voice faded into a static hum until it abruptly cut off, leaving Saumy in his own stunned silence.\n\nFumbling for his phone, Saumy dialed local authorities. His voice trembled as he narrated the chilling events, the attack, the shadowy figure, and the disappearance of Bhanu. They agreed to organize a search for Bhanu at beach.\n\nThe sun was beginning to set, casting eerie shadows over the beach when the police arrived. Equipped with flashlights, they fearlessly ventured towards the sea. Saumy was left at the safety of the car, watching with bated breath as the flashlight beams danced around the darkness.\n\nSuddenly, a sharp gasp echoed over running waves. Saumy strained to see what was happening. But all he could see was the shattered expressions of the officers. Slowly, they returned, carrying a limp figure between them. Bhanu.\n\nSaumy's heart pounded in his chest as he rushed towards his friend. His eyes filled with tears, dreading what he was about to face. But as he reached them, a small miracle occurred, Bhanu coughed. His eyes opened and he looked up at Saumy.\n\nYet, something was different, something had changed in those eyes. They no longer sparkled with the same fearless adventure they once did. Bhanu was alive, but a part of him was lost to the sea. His eyes held a distant, haunted look before they finally closed again.\n\nAs Saumy drove away from the beach, he could feel the spine-chilling gaze of something watching from the sea. He shivered, remembering the cryptic warning on the radio. The sea's wrath awaits. The words echoed ominously in his mind as he left the beach, never to return again.",
  "killed_characters": [],
  "current_characters": [
    "saumy",
    "bhanu"
  ],
  "summary_till_now": "Two adventurous friends, Bhanu and Saumy, ignore a forbidden sign and enter an eerie beach. As they explore, strange events unfold, and they encounter a terrifying shadowy figure emerging from the sea. When the figure attacks, they run in fear, but only Saumy manages to escape, leaving Bhanu behind. The story ends with a sense of impending danger as the figure retreats into the sea.\nSaumy, the lone survivor, escaped a terrifying encounter at the beach with a shadowy figure and the wrath of the sea. After a chilling warning on the radio, he called the authorities to search for his missing friend, Bhanu. The police found Bhanu, barely alive, and Saumy was overcome with relief. However, Bhanu was forever changed by the ordeal. As they left the beach, Saumy couldn't shake the feeling of being watched by something ominous in the sea, haunted by the warning that the sea's wrath awaits. The experience left an indelible mark on both survivors, and they vowed never to return to that beach again."
}